Can you also share cluster version and platform details?
I tried to reproduce it on minikube with K8s 1.15 and it works fine.
```
~ » kubectl version                                                                                           alex@MacBook-Pro
Client Version: version.Info{Major:"1", Minor:"15", GitVersion:"v1.15.3", GitCommit:"2d3c76f9091b6bec110a5e63777c332469e0cba2", GitTreeState:"clean", BuildDate:"2019-08-19T11:13:54Z", GoVersion:"go1.12.9", Compiler:"gc", Platform:"darwin/amd64"}
Server Version: version.Info{Major:"1", Minor:"15", GitVersion:"v1.15.4", GitCommit:"67d2fcf276fcd9cf743ad4be9a9ef5828adc082f", GitTreeState:"clean", BuildDate:"2019-09-18T14:41:55Z", GoVersion:"go1.12.9", Compiler:"gc", Platform:"linux/amd64"}
------------------------------------------------------------
~/test-681 » terraform version                                                                                alex@MacBook-Pro
Terraform v0.12.13
+ provider.kubernetes v1.10.0
------------------------------------------------------------
~/test-681 » terraform plan                                                                                   alex@MacBook-Pro
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_priority_class.monitoring_critical will be created
  + resource "kubernetes_priority_class" "monitoring_critical" {
      + description    = "Used for pods that are critical for monitoring workloads."
      + global_default = false
      + id             = (known after apply)
      + value          = 1900000

      + metadata {
          + generation       = (known after apply)
          + name             = "monitoring-critical"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

------------------------------------------------------------
~/test-681 » terraform apply                                                                                  alex@MacBook-Pro

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_priority_class.monitoring_critical will be created
  + resource "kubernetes_priority_class" "monitoring_critical" {
      + description    = "Used for pods that are critical for monitoring workloads."
      + global_default = false
      + id             = (known after apply)
      + value          = 1900000

      + metadata {
          + generation       = (known after apply)
          + name             = "monitoring-critical"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

kubernetes_priority_class.monitoring_critical: Creating...
kubernetes_priority_class.monitoring_critical: Creation complete after 0s [id=/monitoring-critical]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
------------------------------------------------------------
```